{"data":{"allMarkdownRemark":{"totalCount":32,"edges":[{"node":{"frontmatter":{"title":"An Exploration of Object Recursion Design Patterns with Om Next Recursive Queries - Part 1"},"fields":{"title":"An Exploration of Object Recursion Design Patterns with Om Next Recursive Queries - Part 1","date":"07 Jan 2016","slug":"/2016/01/exploration-patterns-om-next-part-1/"},"excerpt":"<p>The recent <a href=\"https://github.com/omcljs/om/pull/562\">landing of recursive union queries</a> in Om Next allows for defining recursive, heterogeneous data in a simple, expressive way. In a series of posts, I will explore how this conjugates with well-known Software Engineering structural design patterns that are based on object recursion. In this part 1 we will put together a simple component hierarchy that uses the <a href=\"https://en.wikipedia.org/wiki/Composite_pattern\">Composite</a> design pattern. Let's dig into it.</p>\n"}},{"node":{"frontmatter":{"title":"Om Next Query Syntax Explained"},"fields":{"title":"Om Next Query Syntax Explained","date":"04 Jan 2016","slug":"/2016/01/om-next-query-syntax/"},"excerpt":"<p>As more people start tinkering with Om Next, similar questions keep popping up increasingly often. While this is a natural thing given any new learning efforts, there can never be too many resources when we start learning something new. This write-up is an attempt to get people up and running with Om Next's query syntax by providing comprehensive examples and a quick syntax reference for the future.</p>\n"}},{"node":{"frontmatter":{"title":"Om Next Study Material"},"fields":{"title":"Om Next Study Material","date":"10 Dec 2015","slug":"/2015/12/om-next-study-material/"},"excerpt":"<p>It has been a while since Martin Klepsch posted his <a href=\"http://www.martinklepsch.org/posts/om-next-reading-list.html\">Om Next reading list</a>. If you're learning Om Next or planning to, there are a bunch more excellent resources that have recently appeared, and this post compiles a list of some of them.</p>\n"}},{"node":{"frontmatter":{"title":"clj-isitup - a simple isitup.org API client"},"fields":{"title":"clj-isitup - a simple isitup.org API client","date":"17 Nov 2015","slug":"/2015/11/clj-isitup-a-simple-isitup-org-api-client/"},"excerpt":"<p>For sometime around last year, I had been toying with a simple <a href=\"https://isitup.org/\">isitup.org</a> API client and command line tool in Clojure. Just until a few days ago, it was just sitting in <a href=\"https://github.com/anmonteiro\">my GitHub page</a>. Until I decided to put it out there.</p>\n"}},{"node":{"frontmatter":{"title":"Hosting files on the cloud via GitHub Issues"},"fields":{"title":"Hosting files on the cloud via GitHub Issues","date":"26 Sep 2015","slug":"/2015/09/hosting-files-on-the-cloud-via-github-issues/"},"excerpt":"<p>Ever wanted to host pictures or other files on GitHub without storing them in a repository? Here's a simple hack which allows us to host our files directly on GitHub's cloud.</p>\n"}}]}},"pageContext":{"isCreatedByStatefulCreatePages":false,"limit":5,"skip":20,"index":5,"first":false,"last":false}}